In [2]:
import pandas as pd

In [2]:
# Data structures supported by Pandas:
# Series, Dataframes

In [4]:
s1 = pd.Series([3, 5, 8, 2, 7, 4, 1])
s1, type(s1)

(0    3
 1    5
 2    8
 3    2
 4    7
 5    4
 6    1
 dtype: int64,
 pandas.core.series.Series)

In [5]:
s2 = pd.Series([5, 3, 7], index=['a', 'b', 'c'])
s2

a    5
b    3
c    7
dtype: int64

In [6]:
s3 = pd.Series({ 'a': 5, 'b': 3, 'c': 7 })
s3

a    5
b    3
c    7
dtype: int64

In [7]:
# From scalar values
s4 = pd.Series(4, index=['a', 'b', 'c', 'd'])
s4

a    4
b    4
c    4
d    4
dtype: int64

In [16]:
s2['a']
s2[['a', 'b']]
s2.loc[['a', 'c']]

a    5
c    7
dtype: int64

In [13]:
s1[s1 > 5]

2    8
4    7
dtype: int64

In [25]:
s1.index

0

In [41]:
s1.values
s1.describe()

count    7.000000
mean     4.285714
std      2.563480
min      1.000000
25%      2.500000
50%      4.000000
75%      6.000000
max      8.000000
dtype: float64

In [45]:
for item in s2.items():
  print(item)

('a', 5)
('b', 3)
('c', 7)

In [29]:
s2.astype(float)

a    5.0
b    3.0
c    7.0
dtype: float64

In [47]:
series = pd.Series([4, 5, 62, 1])
series.sum() # OR sum(series)
series.max()

62

In [63]:
s = pd.Series(['a', 'b', 'c', 'b', 'a'])
s.value_counts().c

1

In [1]:
# WAP to create a list and take a element input from user and 
# Check if the specific value is present in a Series.

s = pd.Series([4, 5, 62, 1])

int(input()) in s.values

NameError: name 'pd' is not defined

In [11]:
# 1. Find the top N largest values in a Series
s = pd.Series([3, 6, 1, 7, 8, 24])
s.nlargest(3)

5    24
4     8
3     7
dtype: int64

In [12]:
# 2. Check if all elements in a Series are unique

s.is_unique   # Or len(s.unique()) == len(s)

True

### Dataframes

In [70]:
data = {
  'Name': ['Chima', 'Anish', 'Ebuka', 'Esther'],
  'Age': [23, 25, 21, 42],
  'City': ['Lagos', 'New Delhi', 'Aba', 'New York']
}

# data = [{'Name': 'Alice', 'Age': 25, 'City': 'New York'},
#         {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
#         {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'},
#         {'Name': 'David', 'Age': 40, 'City': 'Houston'}]

d1 = pd.DataFrame(data)
d1

     Name  Age       City
0   Chima   23      Lagos
1   Anish   25  New Delhi
2   Ebuka   21        Aba
3  Esther   42   New York

In [71]:
d1['Name']
d1.loc[0]
d1.iloc[1]

Name        Anish
Age            25
City    New Delhi
Name: 1, dtype: object

In [72]:
d1.shape

(4, 3)

In [73]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [74]:
d1[d1['Age'] > 24]

     Name  Age       City
1   Anish   25  New Delhi
3  Esther   42   New York

In [75]:
d1.sort_values(by='Age', ascending=False) # Indexes will be in place
# d1.reset_index(inplace=True)

     Name  Age       City
3  Esther   42   New York
1   Anish   25  New Delhi
0   Chima   23      Lagos
2   Ebuka   21        Aba

In [76]:
# d1.drop('index', inplace=True)
d1

     Name  Age       City
0   Chima   23      Lagos
1   Anish   25  New Delhi
2   Ebuka   21        Aba
3  Esther   42   New York

In [77]:
d1['Salary'] = pd.Series([4000, 6000, 2000, 24,000])
d1

     Name  Age       City  Salary
0   Chima   23      Lagos    4000
1   Anish   25  New Delhi    6000
2   Ebuka   21        Aba    2000
3  Esther   42   New York      24

In [95]:
new_row = pd.DataFrame({'Name': ['Bob', 'David'], 'Age': [30, 26], 'City': ['Los Angeles', 'Lagos']})

d1 = pd.concat([d1, new_row], ignore_index=True) # ignore_index=True creates new index for the new row

d1

     Name  Age         City  Compensation
0   Chima   23        Lagos       60000.0
1   Anish   25    New Delhi       90000.0
2   Ebuka   21          Aba       30000.0
3  Esther   42     New York         360.0
4     Bob   30  Los Angeles           NaN
5     Bob   30  Los Angeles           NaN
6   David   26        Lagos           NaN

In [79]:
# Update an entire column

d1.Salary = d1.Salary * 1.5
d1

     Name  Age         City  Salary
0   Chima   23        Lagos  6000.0
1   Anish   25    New Delhi  9000.0
2   Ebuka   21          Aba  3000.0
3  Esther   42     New York    36.0
4     Bob   30  Los Angeles     NaN

In [85]:
# Rename a column

d1.rename(columns = { 'Payment': 'Compensation' }, inplace=True)
d1

     Name  Age         City  Compensation
0   Chima   23        Lagos        6000.0
1   Anish   25    New Delhi        9000.0
2   Ebuka   21          Aba        3000.0
3  Esther   42     New York          36.0
4     Bob   30  Los Angeles           NaN

In [86]:
d1.Compensation = d1.Compensation * 10
d1

     Name  Age         City  Compensation
0   Chima   23        Lagos       60000.0
1   Anish   25    New Delhi       90000.0
2   Ebuka   21          Aba       30000.0
3  Esther   42     New York         360.0
4     Bob   30  Los Angeles           NaN

In [88]:
d1[d1['Compensation'] > 25000]

    Name  Age       City  Compensation
0  Chima   23      Lagos       60000.0
1  Anish   25  New Delhi       90000.0
2  Ebuka   21        Aba       30000.0

In [94]:
d1.sort_values('Age', ascending=False)

     Name  Age         City  Compensation
3  Esther   42     New York         360.0
4     Bob   30  Los Angeles           NaN
1   Anish   25    New Delhi       90000.0
0   Chima   23        Lagos       60000.0
2   Ebuka   21          Aba       30000.0

In [113]:
# Grouping

city_groups = d1.groupby('City')

city_groups.sum('Salary')
city_groups.max('Age')

             Age  Compensation
City
Aba           21       30000.0
Lagos         26       60000.0
Los Angeles   30           NaN
New Delhi     25       90000.0
New York      42         360.0

In [ ]:
# https://www.w3resource.com/python-exercises/pandas/index.php